[
  {
    "_id": "62a19fa533a482858e4f1a3e",
    "imgOne": "https://i.ibb.co/GvPgKHR/keycap.png",
    "imgTwo": "https://i.ibb.co/6vMcf3n/keycap2.png",
    "imgThree": "https://i.ibb.co/mhZKyrD/keycap3.png",
    "name": "Keycap",
    "type": "personal",
    "clientRepo": "https://github.com/sabbir10s/keycap-client",
    "serverRepo": "https://github.com/sabbir10s/keycap-server",
    "liveSite": "https://keycap-54919.web.app",
    "technology": [
      "React.js",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Firebase",
      "JWT",
      "Hook Form",
      "Stripe",
      "Tailwind CSS"
    ],
    "title": "An E-commerce site with User and Admin Functionality.",
    "description": "Keycap is a React-based e-commerce platform for gadget enthusiasts.The project emphasizes reusability through the implementation of the React Context API. The website caters to both user and admin functionalities, ensuring a seamless experience for all stakeholders.",

    "Features": {
      "User-Centric Design": "Prioritized an intuitive user interface, allowing users to effortlessly browse, add products to the cart, and customize order quantities.",
      "Order Tracking": "Users can track their orders in real-time, providing transparency and peace of mind.",
      "Admin Functionality": "Admins enjoy a comprehensive suite of tools, including order management, product addition, and user management.",
      "Reusable Components": "Employed React Context API to create reusable components, optimizing code efficiency and maintainability."
    },
    "Technology Stack": {
      "Frontend": "React with reusable components.",
      "Styling": "Tailwind for a clean and responsive design.",
      "Backend": "Node and Express for robust server-side functionality.",
      "Database": "MongoDB for efficient data storage and retrieval.",
      "Payment Integration": "Integrated Stripe for secure and hassle-free transactions.",
      "Authentication": "Implemented JWT and Firebase authentication, ensuring a secure and user-friendly experience"
    }
  },
  {
    "_id": "62a19fa5d80987322f93e128",
    "imgOne": "https://i.ibb.co/7thj0jr/gravity.png",
    "imgTwo": "https://i.ibb.co/wSZG3NN/gravity2.png",
    "imgThree": "https://i.ibb.co/dbsFwkf/gravity3.png",
    "name": "Gravity Ltd",
    "type": "team",
    "liveSite": "https://gravityltd.co/",
    "technology": ["React.js", "CSS", "Tailwind CSS"],
    "title": "A Digital Marketing Agency Website with Stylish CSS Transitions",
    "description": "In my role as a front-end developer at Gravity, I spearheaded the creation of our website using React, Tailwind, custom components, and CSS transitions. I introduced smooth transitions and crafted a distinctive custom modal to enhance user engagement. Collaborating closely with the UI/UX designer, I incorporated valuable feedback to refine the website's design. This project, my inaugural effort, is now seamlessly hosted under its domain name. It serves as a testament to Gravity's commitment to providing tailored IT and digital branding solutions, achieving remarkable business outcomes. Explore the culmination of technology and design in this showcase, reflecting Gravity's dedication to digital excellence and innovation."
  },

  {
    "_id": "62a19fa5d80987322f93e178",
    "imgOne": "https://i.ibb.co/6bDRmdW/dailyBuy.png",
    "imgTwo": "https://i.ibb.co/PgtfsjG/daily-Buy2.png",
    "imgThree": "https://i.ibb.co/2vJ22mQ/daily-Buy3.png",
    "name": "Daily-Buy-E-Commerce",
    "type": "team",
    "liveSite": "https://daily-buy-e-commerce-react.vercel.app/",
    "technology": ["React.js", "Redux", "Tailwind CSS"],
    "title": "Dynamic React application, catering to seamless user experiences.",
    "description": "During my internship at Nur Software, I undertook a pivotal role as a front-end developer for the 'Daily-Buy-E-Commerce' project. The project involved transforming a meticulously designed Figma prototype into a responsive and dynamic React application, catering to seamless user experiences across various devices."
  }
]
